sebnor31/MagAlarm/Firmware/CC2510_TX/include/ioCCxx10_bitdef.h
/*******************************************************************************
 *  Flash Controller
 */

// FCTL (0xAE) - Flash Control
#define FCTL_BUSY                         0x80
#define FCTL_SWBSY                        0x40
#define FCTL_CONTRD                       0x10
#define FCTL_WRITE                        0x02
#define FCTL_ERASE                        0x01


// FWDATA (0xAF) - Flash Write Data

// FADDRH (0xAD) - Flash Address High Byte

// FADDRL (0xAC) - Flash Address Low Byte

// FWT (0xAB) - Flash Write Timing (Only bit 0-5 R/W)


/*******************************************************************************
 * I/O Ports
 */

// P0 (0x80) - Port 0 - bit accessible SFR register

// P1 (0x90) - Port 1 - bit accessible SFR register

// P2 (0xA0) - Port 2 - bit accessible SFR register

// PERCFG (0xF1) - Peripheral Control
#define PERCFG_T1CFG                      0x40
#define PERCFG_T3CFG                      0x20
#define PERCFG_T4CFG                      0x10
#define PERCFG_U1CFG                      0x02
#define PERCFG_U0CFG                      0x01



// ADCCFG (0xF2) - ADC input Configuration
#define ADCCFG_7                          0x80
#define ADCCFG_6                          0x40
#define ADCCFG_5                          0x20
#define ADCCFG_4                          0x10
#define ADCCFG_3                          0x08
#define ADCCFG_2                          0x04
#define ADCCFG_1                          0x02
#define ADCCFG_0                          0x01


// P0SEL (0xF3) - Port 0 Function Select (bit 7 not used)

// P1SEL (0xF4) - Port 1 Function Select

// P2SEL (0xF5) - Port 2 Function Select
#define P2SEL_PRI3P1                      0x40
#define P2SEL_PRI2P1                      0x20
#define P2SEL_PRI1P1                      0x10
#define P2SEL_PRI0P1                      0x08
#define P2SEL_SELP2_4                     0x04
#define P2SEL_SELP2_3                     0x02
#define P2SEL_SELP2_0                     0x01


// P0DIR (0xFD) - Port 0 Direction Select

// P1DIR (0xFE) - Port 1 Direction Select

// P2DIR (0xFF) - Port 2 Direction
#define P2DIR_PRIP0                       0xC0
#define P2DIR_0PRIP0                      0x40
#define P2DIR_1PRIP0                      0x80
#define P2DIR_DIRP2                       0x1F

#define P2DIR_PRIP0_0                     (0x00 << 6)
#define P2DIR_PRIP0_1                     (0x01 << 6)
#define P2DIR_PRIP0_2                     (0x02 << 6)
#define P2DIR_PRIP0_3                     (0x03 << 6)

#define P2DIR_DIRP2_4                     (0x10)
#define P2DIR_DIRP2_3                     (0x08)
#define P2DIR_DIRP2_2                     (0x04)
#define P2DIR_DIRP2_1                     (0x02)
#define P2DIR_DIRP2_0                     (0x01)



// P0INP (0x8F) - Port 0 Input Mode (bit 0 & 1 not used)

// P1INP (0xF6) - Port 1 Input Mode (bit 0 & 1 not used)

// P2INP (0xF7) - Port 2 Input Mode
#define P2INP_PDUP2                       0x80
#define P2INP_PDUP1                       0x40
#define P2INP_PDUP0                       0x20
#define P2INP_MDP2                        0x1F

#define P2INP_MDP2_0                      (0x01)
#define P2INP_MDP2_1                      (0x02)
#define P2INP_MDP2_2                      (0x04)
#define P2INP_MDP2_3                      (0x08)
#define P2INP_MDP2_4                      (0x10)



// P0IFG (0x89) - Port 0 Interrupt Status Flag

// P1IFG (0x8A) - Port 1 Interrupt Status Flag

// P2IFG (0x8B) - Port 2 Interrupt Status Flag (bit 7 - 5 not used)

// PICTL (0x8C) - Port Interrupt Control
#define PICTL_PADSC                       0x40
#define PICTL_P2IEN                       0x20
#define PICTL_P0IENH                      0x10
#define PICTL_P0IENL                      0x08
#define PICTL_P2ICON                      0x04
#define PICTL_P1ICON                      0x02
#define PICTL_P0ICON                      0x01


// P1IEN (0x8D) - Port 1 Interrupt Mask



/*******************************************************************************
 * DMA Controller
 */

// DMAARM (0xD6) - DMA Channel Arm
#define DMAARM_ABORT                      0x80
#define DMAARM4                           0x10
#define DMAARM3                           0x08
#define DMAARM2                           0x04
#define DMAARM1                           0x02
#define DMAARM0                           0x01


// DMAREQ (0xD7) - DMA Channel Start Request and Status
#define DMAREQ4                           0x10
#define DMAREQ3                           0x08
#define DMAREQ2                           0x04
#define DMAREQ1                           0x02
#define DMAREQ0                           0x01


// DMA0CFGH (0xD5) - DMA Channel 0 Configuration Address High Byte

// DMA0CFGL (0xD4) - DMA Channel 0 Configuration Address Low Byte

// DMA1CFGH (0xD3) - DMA Channel 1 - 4 Configuration Address High By

// DMA1CFGL (0xD2) - DMA Channel 1 - 4 Configuration Address Low Byte

// DMAIRQ (0xD1) - DMA Interrupt Flag
#define DMAIRQ_DMAIF4                     0x10
#define DMAIRQ_DMAIF3                     0x08
#define DMAIRQ_DMAIF2                     0x04
#define DMAIRQ_DMAIF1                     0x02
#define DMAIRQ_DMAIF0                     0x01


// T1CNTH (0xE3) - Timer 1 Counter High

// T1CNTL (0xE2) - Timer 1 Counter Low

// T1CTL (0xE4) - Timer 1 Control and Status
#define T1CTL_CH2IF                       0x80 // Timer 1 channel 2 interrupt flag
#define T1CTL_CH1IF                       0x40 // Timer 1 channel 1 interrupt flag
#define T1CTL_CH0IF                       0x20 // Timer 1 channel 0 interrupt flag
#define T1CTL_OVFIF                       0x10 // Timer 1 counter overflow interrupt flag
#define T1CTL_DIV                         0x0C
#define T1CTL_DIV0                        0x04
#define T1CTL_DIV1                        0x08
#define T1CTL_MODE                        0x03
#define T1CTL_MODE0                       0x01
#define T1CTL_MODE1                       0x02

#define T1CTL_DIV_1                       (0x00 << 2) // Divide tick frequency by 1
#define T1CTL_DIV_8                       (0x01 << 2) // Divide tick frequency by 8
#define T1CTL_DIV_32                      (0x02 << 2) // Divide tick frequency by 32
#define T1CTL_DIV_128                     (0x03 << 2) // Divide tick frequency by 128

#define T1CTL_MODE_SUSPEND                (0x00)    // Operation is suspended (halt)
#define T1CTL_MODE_FREERUN                (0x01)    // Free Running mode
#define T1CTL_MODE_MODULO                 (0x02)    // Modulo
#define T1CTL_MODE_UPDOWN                 (0x03)    // Up/down


// T1CCTL0 (0xE5) - Timer 1 Channel 0 Capture/Compare Control
#define T1CCTL0_CPSEL                     0x80    // Timer 1 channel 0 capture select
#define T1CCTL0_IM                        0x40    // Channel 0 Interrupt mask
#define T1CCTL0_CMP                       0x38
#define T1CCTL0_CMP0                      0x08
#define T1CCTL0_CMP1                      0x10
#define T1CCTL0_CMP2                      0x20
#define T1CCTL0_MODE                      0x04    // Capture or compare mode
#define T1CCTL0_CAP                       0x03
#define T1CCTL0_CAP0                      0x01
#define T1CCTL0_CAP1                      0x02

#define T1C0_SET_ON_CMP                   (0x00 << 3)    // Clear output on compare-up set on 0
#define T1C0_CLR_ON_CMP                   (0x01 << 3)    // Set output on compare-up clear on 0
#define T1C0_TOG_ON_CMP                   (0x02 << 3)    // Toggle output on compare
#define T1C0_SET_CMP_UP_CLR_0             (0x03 << 3)    // Clear output on compare
#define T1C0_CLR_CMP_UP_SET_0             (0x04 << 3)    // Set output on compare

#define T1C0_NO_CAP                       (0x00)    // No capture
#define T1C0_RISE_EDGE                    (0x01)    // Capture on rising edge
#define T1C0_FALL_EDGE                    (0x02)    // Capture on falling edge
#define T1C0_BOTH_EDGE                    (0x03)    // Capture on both edges


// T1CC0H (0xDB) - Timer 1 Channel 0 Capture/Compare Value High

// T1CC0L (0xDA) - Timer 1 Channel 0 Capture/Compare Value Low

// T1CCTL1 (0xE6) - Timer 1 Channel 1 Capture/Compare Control
#define T1CCTL1_CPSEL                     0x80    // Timer 1 channel 1 capture select
#define T1CCTL1_IM                        0x40    // Channel 1 Interrupt mask
#define T1CCTL1_CMP                       0x38
#define T1CCTL1_CMP0                      0x08
#define T1CCTL1_CMP1                      0x10
#define T1CCTL1_CMP2                      0x20
#define T1CCTL1_MODE                      0x04    // Capture or compare mode
#define T1CCTL1_DSM_SPD                   0x04
#define T1CCTL1_CAP                       0x03
#define T1CCTL1_CAP0                      0x01
#define T1CCTL1_CAP1                      0x02

#define T1C1_SET_ON_CMP                   (0x00 << 3)  // Set output on compare
#define T1C1_CLR_ON_CMP                   (0x01 << 3)  // Clear output on compare
#define T1C1_TOG_ON_CMP                   (0x02 << 3)  // Toggle output on compare
#define T1C1_SET_CMP_UP_CLR_0             (0x03 << 3)  // Set output on compare-up clear on 0
#define T1C1_CLR_CMP_UP_SET_0             (0x04 << 3)  // Clear output on compare-up set on 0
#define T1C1_SET_C1_CLR_C0                (0x05 << 3)  // Set when equal to T1CC1, clear when equal to T1CC0
#define T1C1_CLR_C1_SET_C0                (0x06 << 3)  // Clear when equal to T1CC1, set when equal to T1CC0
#define T1C1_DSM_MODE                     (0x07 << 3)  // DSM mode

