sebnor31/MagAlarm/Firmware/CC2510_TX/include/ioCCxx10_bitdef.h
#define T1C1_NO_CAP                       (0x00)     // No capture
#define T1C1_RISE_EDGE                    (0x01)    // Capture on rising edge
#define T1C1_FALL_EDGE                    (0x02)    // Capture on falling edge
#define T1C1_BOTH_EDGE                    (0x03)    // Capture on both edges

#define DSM_IP_ON_OS_ON                   (0x00)    // Interpolator & output shaping enabled
#define DSM_IP_ON_OS_OFF                  (0x01)    // Interpolator enabled & output shaping disabled
#define DSM_IP_OFF_OS_ON                  (0x02)    // Interpolator disabled & output shaping enabled
#define DSM_IP_OFF_OS_OFF                 (0x03)    // Interpolator & output shaping disabled



// T1CC1H (0xDD) - Timer 1 Channel 1 Capture/Compare Value High

// T1CC1L (0xDC) - Timer 1 Channel 1 Capture/Compare Value Low

// T1CCTL2 (0xE7) - Timer 1 Channel 2 Capture/Compare Control
#define T1CCTL2_CPSEL                     0x80    // Timer 1 channel 2 capture select
#define T1CCTL2_IM                        0x40    // Channel 2 Interrupt mask
#define T1CCTL2_CMP                       0x38
#define T1CCTL2_CMP0                      0x08
#define T1CCTL2_CMP1                      0x10
#define T1CCTL2_CMP2                      0x20
#define T1CCTL2_MODE                      0x04    // Capture or compare mode
#define T1CCTL2_CAP                       0x03
#define T1CCTL2_CAP0                      0x01
#define T1CCTL2_CAP1                      0x02

#define T1C2_SET_ON_CMP                   (0x00 << 3)  // Set output on compare
#define T1C2_CLR_ON_CMP                   (0x01 << 3)  // Clear output on compare
#define T1C2_TOG_ON_CMP                   (0x02 << 3)  // Toggle output on compare
#define T1C2_SET_CMP_UP_CLR_0             (0x03 << 3)  // Set output on compare-up clear on 0
#define T1C2_CLR_CMP_UP_SET_0             (0x04 << 3)  // Clear output on compare-up set on 0
#define T1C2_SET_C2_CLR_C0                (0x05 << 3)  // Set when equal to T1CC2, clear when equal to T1CC0
#define T1C2_CLR_C2_SET_C0                (0x06 << 3)  // Clear when equal to T1CC2, set when equal to T1CC0

#define T1C2_NO_CAP                       (0x00)     // No capture
#define T1C2_RISE_EDGE                    (0x01)    // Capture on rising edge
#define T1C2_FALL_EDGE                    (0x02)    // Capture on falling edge
#define T1C2_BOTH_EDGE                    (0x03)    // Capture on both edges


// T1CC2H (0xDF) - Timer 1 Channel 2 Capture/Compare Value High

// T1CC2L (0xDE) - Timer 1 Channel 2 Capture/Compare Value Low

// T2CTL (0x9E) - Timer 2 Control
#define T2CTL_TEX                         0x40
#define T2CTL_INT                         0x10    // Enable Timer 2 interrupt
#define T2CTL_TIG                         0x04    // Tick generator mode
#define T2CTL_TIP                         0x03
#define T2CTL_TIP0                        0x01
#define T2CTL_TIP1                        0x02

#define T2CTL_TIP_64                      (0x00)
#define T2CTL_TIP_128                     (0x01)
#define T2CTL_TIP_256                     (0x02)
#define T2CTL_TIP_1024                    (0x03)


// T2CT (0x9C) - Timer 2 Count

// T2PR (0x9D) - Timer 2 Prescaler

// WORTIME0 (0xA5) - Sleep Timer Low Byte

// WORTIME1 (0xA6) - Sleep Timer High Byte

// WOREVT1 (0xA4) - Sleep Timer Event0 Timeout High

// WOREVT0 (0xA3) - Sleep Timer Event0 Timeout Low

// WORCTL (0xA2) - Sleep Timer Control
#define WORCTL_WOR_RESET                  0x04
#define WORCTL_WOR_RES                    0x03
#define WORCTL_WOR_RES0                   0x01
#define WORCTL_WOR_RES1                   0x02

#define WORCTL_WOR_RES_1                  (0x00)
#define WORCTL_WOR_RES_32                 (0x01)
#define WORCTL_WOR_RES_1024               (0x02)
#define WORCTL_WOR_RES_32768              (0x03)


// WORIRQ (0xA1) - Sleep Timer Interrupt Control
#define WORIRQ_EVENT0_MASK                0x10
#define WORIRQ_EVENT0_FLAG                0x01


// T3CNT (0xCA) - Timer 3 Counter

// T3CTL (0xCB) - Timer 3 Control
#define T3CTL_DIV                         0xE0
#define T3CTL_DIV0                        0x20
#define T3CTL_DIV1                        0x40
#define T3CTL_DIV2                        0x80
#define T3CTL_START                       0x10
#define T3CTL_OVFIM                       0x08
#define T3CTL_CLR                         0x04
#define T3CTL_MODE                        0x03
#define T3CTL_MODE0                       0x01
#define T3CTL_MODE1                       0x02

#define T3CTL_DIV_1                       (0x00 << 5)
#define T3CTL_DIV_2                       (0x01 << 5)
#define T3CTL_DIV_4                       (0x02 << 5)
#define T3CTL_DIV_8                       (0x03 << 5)
#define T3CTL_DIV_16                      (0x04 << 5)
#define T3CTL_DIV_32                      (0x05 << 5)
#define T3CTL_DIV_64                      (0x06 << 5)
#define T3CTL_DIV_128                     (0x07 << 5)

#define T3CTL_MODE_FREERUN                (0x00)
#define T3CTL_MODE_DOWN                   (0x01)
#define T3CTL_MODE_MODULO                 (0x02)
#define T3CTL_MODE_UPDOWN                 (0x03)



// T3CCTL0 (0xCC) - Timer 3 Channel 0 Compare Control
#define T3CCTL0_IM                        0x40
#define T3CCTL0_MODE                      0x04
#define T3CCTL0_CMP                       0x38
#define T3CCTL0_CMP0                      0x08
#define T3CCTL0_CMP1                      0x10
#define T3CCTL0_CMP2                      0x20

#define T3C0_SET_ON_CMP                   (0x00 << 3)  // Set output on compare
#define T3C0_CLR_ON_CMP                   (0x01 << 3)  // Clear output on compare
#define T3C0_TOG_ON_CMP                   (0x02 << 3)  // Toggle output on compare
#define T3C0_SET_CMP_UP_CLR_0             (0x03 << 3)  // Set output on compare-up clear on 0
#define T3C0_CLR_CMP_UP_SET_0             (0x04 << 3)  // Clear output on compare-up set on 0
#define T3C0_SET_CMP_CLR_255              (0x05 << 3)  // Set when equal to T3CC0, clear on 255
#define T3C0_CLR_CMP_SET_0                (0x06 << 3)  // Clear when equal to T3CC0, set on 0



// T3CC0 (0xCD) - Timer 3 Channel 0 Compare Value

// T3CCTL1 (0xCE) - Timer 3 Channel 1 Compare Control

#define T3CCTL1_IM                        0x40
#define T3CCTL1_MODE                      0x04
#define T3CCTL1_CMP                       0x38
#define T3CCTL1_CMP0                      0x08
#define T3CCTL1_CMP1                      0x10
#define T3CCTL1_CMP2                      0x20

#define T3C1_SET_ON_CMP                   (0x00 << 3)  // Set output on compare
#define T3C1_CLR_ON_CMP                   (0x01 << 3)  // Clear output on compare
#define T3C1_TOG_ON_CMP                   (0x02 << 3)  // Toggle output on compare
#define T3C1_SET_CMP_UP_CLR_0             (0x03 << 3)  // Set output on compare-up clear on 0
#define T3C1_CLR_CMP_UP_SET_0             (0x04 << 3)  // Clear output on compare-up set on 0
#define T3C1_SET_CMP_CLR_C0               (0x05 << 3)  // Set when equal to T3CC1, clear when equal to T3CC0
#define T3C1_CLR_CMP_SET_C0               (0x06 << 3)  // Clear when equal to T3CC1, set when equal to T3CC0


// T3CC1 (0xCF) - Timer 3 Channel 1 Compare Value

// T4CNT (0xEA) - Timer 4 Counter

// T4CTL (0xEB) - Timer 4 Control
#define T4CTL_DIV                         0xE0
#define T4CTL_DIV0                        0x20
#define T4CTL_DIV1                        0x40
#define T4CTL_DIV2                        0x80
#define T4CTL_START                       0x10
#define T4CTL_OVFIM                       0x08
#define T4CTL_CLR                         0x04
#define T4CTL_MODE                        0x03
#define T4CTL_MODE0                       0x01
#define T4CTL_MODE1                       0x02

#define T4CTL_MODE_FREERUN                (0x00)
#define T4CTL_MODE_DOWN                   (0x01)
#define T4CTL_MODE_MODULO                 (0x02)
#define T4CTL_MODE_UPDOWN                 (0x03)

#define T4CTL_DIV_1                       (0x00 << 5)
#define T4CTL_DIV_2                       (0x01 << 5)
#define T4CTL_DIV_4                       (0x02 << 5)
#define T4CTL_DIV_8                       (0x03 << 5)
#define T4CTL_DIV_16                      (0x04 << 5)
#define T4CTL_DIV_32                      (0x05 << 5)
#define T4CTL_DIV_64                      (0x06 << 5)
#define T4CTL_DIV_128                     (0x07 << 5)


// T4CCTL0 (0xEC) - Timer 4 Channel 0 Compare Control
#define T4CCTL0_IM                        0x40
#define T4CCTL0_CMP                       0x38
#define T4CCTL0_CMP0                      0x08
#define T4CCTL0_CMP1                      0x10
#define T4CCTL0_CMP2                      0x20
#define T4CCTL0_MODE                      0x04

#define T4CCTL0_SET_ON_CMP                (0x00 << 3)
#define T4CCTL0_CLR_ON_CMP                (0x01 << 3)
#define T4CCTL0_TOG_ON_CMP                (0x02 << 3)
#define T4CCTL0_SET_CMP_UP_CLR_0          (0x03 << 3)
#define T4CCTL0_CLR_CMP_UP_SET_0          (0x04 << 3)
#define T4CCTL0_SET_CMP_CLR_255           (0x05 << 3)
#define T4CCTL0_CLR_CMP_SET_0             (0x06 << 3)


